; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))

  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))

  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (and (calibrated ?i)))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (and (have_image ?d ?m))))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	instrument2 - instrument
	satellite1 - satellite
	instrument3 - instrument
	instrument4 - instrument
	satellite2 - satellite
	instrument5 - instrument
	instrument6 - instrument
	instrument7 - instrument
	satellite3 - satellite
	instrument8 - instrument
	instrument9 - instrument
	satellite4 - satellite
	instrument10 - instrument
	instrument11 - instrument
	instrument12 - instrument
	thermograph0 - mode
	spectrograph2 - mode
	spectrograph3 - mode
	spectrograph1 - mode
	GroundStation0 - direction
	GroundStation3 - direction
	GroundStation1 - direction
	GroundStation2 - direction
	Planet4 - direction
	Planet5 - direction
	Star6 - direction
	Phenomenon7 - direction
	Star8 - direction
	Phenomenon9 - direction
	Star10 - direction
	Planet11 - direction
	Planet12 - direction
	Star13 - direction
	Phenomenon14 - direction
	Star15 - direction
	Planet16 - direction
	Star17 - direction
	Phenomenon18 - direction
	Planet19 - direction
	Star20 - direction
	Planet21 - direction
	Planet22 - direction
	Phenomenon23 - direction
	Phenomenon24 - direction
	Star25 - direction
	Planet26 - direction
)
(:init
	(supports instrument0 thermograph0)
	(supports instrument0 spectrograph1)
	(supports instrument0 spectrograph2)
	(calibration_target instrument0 GroundStation2)
	(supports instrument1 spectrograph2)
	(supports instrument1 spectrograph1)
	(calibration_target instrument1 GroundStation0)
	(supports instrument2 spectrograph1)
	(supports instrument2 spectrograph2)
	(supports instrument2 thermograph0)
	(calibration_target instrument2 GroundStation1)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(on_board instrument2 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Planet22)
	(supports instrument3 spectrograph1)
	(supports instrument3 spectrograph3)
	(calibration_target instrument3 GroundStation0)
	(supports instrument4 spectrograph3)
	(supports instrument4 spectrograph2)
	(supports instrument4 spectrograph1)
	(calibration_target instrument4 GroundStation1)
	(on_board instrument3 satellite1)
	(on_board instrument4 satellite1)
	(power_avail satellite1)
	(pointing satellite1 Planet12)
	(supports instrument5 spectrograph3)
	(supports instrument5 spectrograph2)
	(calibration_target instrument5 GroundStation2)
	(supports instrument6 thermograph0)
	(supports instrument6 spectrograph1)
	(supports instrument6 spectrograph3)
	(calibration_target instrument6 GroundStation0)
	(supports instrument7 spectrograph1)
	(supports instrument7 spectrograph2)
	(supports instrument7 spectrograph3)
	(calibration_target instrument7 GroundStation2)
	(on_board instrument5 satellite2)
	(on_board instrument6 satellite2)
	(on_board instrument7 satellite2)
	(power_avail satellite2)
	(pointing satellite2 Planet12)
	(supports instrument8 spectrograph2)
	(supports instrument8 thermograph0)
	(supports instrument8 spectrograph1)
	(calibration_target instrument8 GroundStation3)
	(supports instrument9 spectrograph1)
	(calibration_target instrument9 GroundStation1)
	(on_board instrument8 satellite3)
	(on_board instrument9 satellite3)
	(power_avail satellite3)
	(pointing satellite3 Star20)
	(supports instrument10 thermograph0)
	(calibration_target instrument10 GroundStation1)
	(supports instrument11 spectrograph1)
	(supports instrument11 thermograph0)
	(calibration_target instrument11 GroundStation1)
	(supports instrument12 spectrograph1)
	(supports instrument12 spectrograph3)
	(supports instrument12 spectrograph2)
	(calibration_target instrument12 GroundStation2)
	(on_board instrument10 satellite4)
	(on_board instrument11 satellite4)
	(on_board instrument12 satellite4)
	(power_avail satellite4)
	(pointing satellite4 Star20)
)
(:goal (and
	(pointing satellite0 Star13)
	(pointing satellite2 GroundStation0)
	(pointing satellite3 GroundStation1)
	(pointing satellite4 Star8)
	(have_image Planet4 spectrograph2)
	(have_image Planet5 thermograph0)
	(have_image Phenomenon7 thermograph0)
	(have_image Star8 thermograph0)
	(have_image Phenomenon9 thermograph0)
	(have_image Star10 thermograph0)
	(have_image Planet11 spectrograph1)
	(have_image Planet12 thermograph0)
	(have_image Star13 spectrograph3)
	(have_image Phenomenon14 spectrograph2)
	(have_image Star15 spectrograph2)
	(have_image Planet16 spectrograph3)
	(have_image Star17 thermograph0)
	(have_image Phenomenon18 spectrograph1)
	(have_image Planet19 spectrograph1)
	(have_image Star20 thermograph0)
	(have_image Planet21 spectrograph2)
	(have_image Planet22 thermograph0)
	(have_image Phenomenon23 spectrograph1)
	(have_image Star25 thermograph0)
	(have_image Planet26 thermograph0)
))

)

; plan
1. (switch_on instrument10 satellite4)
   deleted: (power_avail satellite4)
   added: (power_on instrument10)
   goals met: 0 of 25
2. (switch_on instrument4 satellite1)
   deleted: (power_avail satellite1)
   added: (power_on instrument4)
   goals met: 0 of 25
3. (turn_to satellite4 groundstation1 star20)
   deleted: (pointing satellite4 star20)
   added: (pointing satellite4 groundstation1)
   goals met: 0 of 25
4. (calibrate satellite4 instrument10 groundstation1)
   added: (calibrated instrument10)
   goals met: 0 of 25
5. (turn_to satellite4 phenomenon7 groundstation1)
   deleted: (pointing satellite4 groundstation1)
   added: (pointing satellite4 phenomenon7)
   goals met: 0 of 25
6. (take_image satellite4 phenomenon7 instrument10 thermograph0)
   added: (have_image phenomenon7 thermograph0)
   goals met: 1 of 25
7. (turn_to satellite4 phenomenon9 phenomenon7)
   deleted: (pointing satellite4 phenomenon7)
   added: (pointing satellite4 phenomenon9)
   goals met: 1 of 25
8. (take_image satellite4 phenomenon9 instrument10 thermograph0)
   added: (have_image phenomenon9 thermograph0)
   goals met: 2 of 25
9. (turn_to satellite4 planet12 phenomenon9)
   deleted: (pointing satellite4 phenomenon9)
   added: (pointing satellite4 planet12)
   goals met: 2 of 25
10. (take_image satellite4 planet12 instrument10 thermograph0)
   added: (have_image planet12 thermograph0)
   goals met: 3 of 25
11. (turn_to satellite4 planet22 planet12)
   deleted: (pointing satellite4 planet12)
   added: (pointing satellite4 planet22)
   goals met: 3 of 25
12. (take_image satellite4 planet22 instrument10 thermograph0)
   added: (have_image planet22 thermograph0)
   goals met: 4 of 25
13. (turn_to satellite4 planet26 planet22)
   deleted: (pointing satellite4 planet22)
   added: (pointing satellite4 planet26)
   goals met: 4 of 25
14. (take_image satellite4 planet26 instrument10 thermograph0)
   added: (have_image planet26 thermograph0)
   goals met: 5 of 25
15. (turn_to satellite4 planet5 planet26)
   deleted: (pointing satellite4 planet26)
   added: (pointing satellite4 planet5)
   goals met: 5 of 25
16. (take_image satellite4 planet5 instrument10 thermograph0)
   added: (have_image planet5 thermograph0)
   goals met: 6 of 25
17. (turn_to satellite4 star10 planet5)
   deleted: (pointing satellite4 planet5)
   added: (pointing satellite4 star10)
   goals met: 6 of 25
18. (take_image satellite4 star10 instrument10 thermograph0)
   added: (have_image star10 thermograph0)
   goals met: 7 of 25
19. (turn_to satellite4 star17 star10)
   deleted: (pointing satellite4 star10)
   added: (pointing satellite4 star17)
   goals met: 7 of 25
20. (take_image satellite4 star17 instrument10 thermograph0)
   added: (have_image star17 thermograph0)
   goals met: 8 of 25
21. (turn_to satellite4 star20 star17)
   deleted: (pointing satellite4 star17)
   added: (pointing satellite4 star20)
   goals met: 8 of 25
22. (take_image satellite4 star20 instrument10 thermograph0)
   added: (have_image star20 thermograph0)
   goals met: 9 of 25
23. (turn_to satellite4 star25 star20)
   deleted: (pointing satellite4 star20)
   added: (pointing satellite4 star25)
   goals met: 9 of 25
24. (take_image satellite4 star25 instrument10 thermograph0)
   added: (have_image star25 thermograph0)
   goals met: 10 of 25
25. (turn_to satellite4 star8 star25)
   deleted: (pointing satellite4 star25)
   added: (pointing satellite4 star8)
   goals met: 11 of 25
26. (take_image satellite4 star8 instrument10 thermograph0)
   added: (have_image star8 thermograph0)
   goals met: 12 of 25
27. (turn_to satellite3 groundstation1 star20)
   deleted: (pointing satellite3 star20)
   added: (pointing satellite3 groundstation1)
   goals met: 13 of 25
28. (turn_to satellite2 groundstation0 planet12)
   deleted: (pointing satellite2 planet12)
   added: (pointing satellite2 groundstation0)
   goals met: 14 of 25
29. (turn_to satellite1 groundstation1 planet12)
   deleted: (pointing satellite1 planet12)
   added: (pointing satellite1 groundstation1)
   goals met: 14 of 25
30. (calibrate satellite1 instrument4 groundstation1)
   added: (calibrated instrument4)
   goals met: 14 of 25
31. (turn_to satellite1 phenomenon14 groundstation1)
   deleted: (pointing satellite1 groundstation1)
   added: (pointing satellite1 phenomenon14)
   goals met: 14 of 25
32. (take_image satellite1 phenomenon14 instrument4 spectrograph2)
   added: (have_image phenomenon14 spectrograph2)
   goals met: 15 of 25
33. (turn_to satellite1 phenomenon18 phenomenon14)
   deleted: (pointing satellite1 phenomenon14)
   added: (pointing satellite1 phenomenon18)
   goals met: 15 of 25
34. (take_image satellite1 phenomenon18 instrument4 spectrograph1)
   added: (have_image phenomenon18 spectrograph1)
   goals met: 16 of 25
35. (turn_to satellite1 phenomenon23 phenomenon18)
   deleted: (pointing satellite1 phenomenon18)
   added: (pointing satellite1 phenomenon23)
   goals met: 16 of 25
36. (take_image satellite1 phenomenon23 instrument4 spectrograph1)
   added: (have_image phenomenon23 spectrograph1)
   goals met: 17 of 25
37. (turn_to satellite1 planet11 phenomenon23)
   deleted: (pointing satellite1 phenomenon23)
   added: (pointing satellite1 planet11)
   goals met: 17 of 25
38. (take_image satellite1 planet11 instrument4 spectrograph1)
   added: (have_image planet11 spectrograph1)
   goals met: 18 of 25
39. (turn_to satellite1 planet16 planet11)
   deleted: (pointing satellite1 planet11)
   added: (pointing satellite1 planet16)
   goals met: 18 of 25
40. (take_image satellite1 planet16 instrument4 spectrograph3)
   added: (have_image planet16 spectrograph3)
   goals met: 19 of 25
41. (turn_to satellite1 planet19 planet16)
   deleted: (pointing satellite1 planet16)
   added: (pointing satellite1 planet19)
   goals met: 19 of 25
42. (take_image satellite1 planet19 instrument4 spectrograph1)
   added: (have_image planet19 spectrograph1)
   goals met: 20 of 25
43. (turn_to satellite1 planet21 planet19)
   deleted: (pointing satellite1 planet19)
   added: (pointing satellite1 planet21)
   goals met: 20 of 25
44. (take_image satellite1 planet21 instrument4 spectrograph2)
   added: (have_image planet21 spectrograph2)
   goals met: 21 of 25
45. (turn_to satellite1 planet4 planet21)
   deleted: (pointing satellite1 planet21)
   added: (pointing satellite1 planet4)
   goals met: 21 of 25
46. (take_image satellite1 planet4 instrument4 spectrograph2)
   added: (have_image planet4 spectrograph2)
   goals met: 22 of 25
47. (turn_to satellite1 star13 planet4)
   deleted: (pointing satellite1 planet4)
   added: (pointing satellite1 star13)
   goals met: 22 of 25
48. (take_image satellite1 star13 instrument4 spectrograph3)
   added: (have_image star13 spectrograph3)
   goals met: 23 of 25
49. (turn_to satellite1 star15 star13)
   deleted: (pointing satellite1 star13)
   added: (pointing satellite1 star15)
   goals met: 23 of 25
50. (take_image satellite1 star15 instrument4 spectrograph2)
   added: (have_image star15 spectrograph2)
   goals met: 24 of 25
51. (turn_to satellite0 star13 planet22)
   deleted: (pointing satellite0 planet22)
   added: (pointing satellite0 star13)
   goals met: 25 of 25
